Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.StartOffsetIsAutomatic Property
 Gets or sets a value indicating whether the start offset is automatic. When automatic the proposed start offset is calculated to be the concrete cover thickness plus half the reinforcing bar diameter.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool StartOffsetIsAutomatic { get; set; }
Public Property StartOffsetIsAutomatic As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace